<a href="https://colab.research.google.com/github/goverdhana-srihitha/file1/blob/master/Day_19(15_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Shared Document :  http://tiny.cc/DataCleaning
#### Data source : http://bit.ly/movieusers

### Import the Libraries
### Import the Dataset

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn

In [4]:
## Importing the Dataset 
data = pd.read_table("http://bit.ly/movieusers")
data

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [11]:
## By using csv -->inbuilt seperated by ( , )--> in a proper structure 
data = pd.read_table("http://bit.ly/movieusers",sep = "|") # using sepeartor ( sep )
data.head(6)

   1  24  M     technician  85711
0  2  53  F          other  94043
1  3  23  M         writer  32067
2  4  24  M     technician  43537
3  5  33  F          other  15213
4  6  42  M      executive  98101
5  7  57  M  administrator  91344

In [13]:
data = pd.read_table("http://bit.ly/movieusers",sep = "|",header = None) 
data.head(3)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067

#### Handling Missing Values
Data can have missing values for a number of reasons such as observations that were not recorded and data corruption.

Handling missing data is important as many machine learning algorithms do not support data with missing values.

In [3]:
# Reading the dataset
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [4]:
# # Checking the datatype of the day column
df.day.dtype # object type

dtype('O')

In [6]:
#  Checking the type of the day column's value
type(df.day[0]) # string

str

In [7]:
df.columns.value_counts()

temperature    1
windspeed      1
day            1
event          1
dtype: int64

In [8]:
# Mode  Checking the occurances(or) frequency of the values in a particular column
import pandas as pd
df['temperature'].value_counts()

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [10]:
# To check duplicate values
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [11]:
# Checking for duplicates specific temperature column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [12]:
df['temperature'].duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: temperature, dtype: bool

In [14]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [15]:
# Frequency
df['event'].value_counts()

0        2
Rain     2
Sunny    2
Snow     1
Name: event, dtype: int64

In [16]:
#  Using parse_dates for the day column to convert the data type of the day column to datetime
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",
                 parse_dates = ['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [17]:
df.day.dtype

dtype('<M8[ns]')

In [18]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [19]:
# replacing the particular values of different columns with NaN
new_df = df.replace({'temperature': -99999, 'windspeed': -99999,'event':0}, np.nan)
new_df  #replace(oldvalue,new value)

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [21]:
# Checking the total number of missing values
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          0
dtype: int64

In [22]:
# fillna is used to fill the missing values
data = new_df.fillna(0)
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [23]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [24]:
#ffill --> forward fill; To fill the values in a column with the above row's value
f_data = new_df.fillna(method='ffill')
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0      0
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [25]:
#bfill --> backward fill; To fill the values in a column with the below row's value
b_data = new_df.fillna(method='bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0      0
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [26]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

### **Imputation** :
#### Imputation is a procss of substituting the missing values

Imputation is the method in which the missing value of a certain variable is replaced by the mean of the available cases.

In [28]:
## Mean Imputation 
mean_data = new_df.fillna(new_df.mean())
## fill the missing values in a column with the column's mean value
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0      0
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [0]:
## Median Imputation :

In [31]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [32]:
## Median Imputation: filling the missing values in a column with the corresponding median value of a column
median_data = new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0      0
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [41]:
# Calculating the MODE for event column 
new_df.event.mode()

0        0
1     Rain
2    Sunny
dtype: object

In [42]:
# Filling the missing values in the event column with Mode of that particular column
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [40]:
event_data = new_df['event'].fillna(new_df.event.mode().iloc[0])
print(event_data)

0     Rain
1    Sunny
2     Snow
3        0
4     Rain
5    Sunny
6        0
Name: event, dtype: object

In [64]:
new_df.isnull()

     day  temperature  windspeed  event
0  False        False      False  False
1  False         True      False  False
2  False        False       True  False
3  False         True      False  False
4  False        False       True  False
5  False        False      False  False
6  False        False      False  False

In [65]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          0
dtype: int64

In [73]:
# fillna() is a function which is used to fill the missing values
new_df.fillna(0,inplace = True) #shift_Tab 4 times for 
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [74]:
df1 = new_df.fillna(0)
df1

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [75]:
new_df.fillna(method = 'ffill')
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [68]:
f = new_df.fillna(method = 'ffill')
f

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [69]:
# bfill--> backfill
b_data = new_df.fillna(method='bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0